In [12]:
import pandas as pd
import numpy as np

In [13]:
data = np.random.randn(4, 3)

In [14]:
dataFrame = pd.DataFrame(data)

In [15]:
newDataFrame = pd.DataFrame(data = data, index = ["One","Two","Three","Four"], columns = ["A","B","C"])

In [16]:
newDataFrame

              A         B         C
One    0.396502 -1.042548  0.997983
Two    1.085677 -2.484634 -1.188365
Three  0.309127  1.063626 -2.206446
Four   0.877064  0.089869  0.749024

In [17]:
newDataFrame["D"] = np.arange(1, 5)

In [18]:
newDataFrame

              A         B         C  D
One    0.396502 -1.042548  0.997983  1
Two    1.085677 -2.484634 -1.188365  2
Three  0.309127  1.063626 -2.206446  3
Four   0.877064  0.089869  0.749024  4

In [19]:
newDataFrame["D"] = newDataFrame["A"]

In [20]:
newDataFrame

              A         B         C         D
One    0.396502 -1.042548  0.997983  0.396502
Two    1.085677 -2.484634 -1.188365  1.085677
Three  0.309127  1.063626 -2.206446  0.309127
Four   0.877064  0.089869  0.749024  0.877064

In [21]:
newDataFrame.drop("D", axis = 1)

              A         B         C
One    0.396502 -1.042548  0.997983
Two    1.085677 -2.484634 -1.188365
Three  0.309127  1.063626 -2.206446
Four   0.877064  0.089869  0.749024

* x -> 1 , y -> 0

In [22]:
newDataFrame.drop("Three", axis = 0)

             A         B         C         D
One   0.396502 -1.042548  0.997983  0.396502
Two   1.085677 -2.484634 -1.188365  1.085677
Four  0.877064  0.089869  0.749024  0.877064

In [23]:
newDataFrame

              A         B         C         D
One    0.396502 -1.042548  0.997983  0.396502
Two    1.085677 -2.484634 -1.188365  1.085677
Three  0.309127  1.063626 -2.206446  0.309127
Four   0.877064  0.089869  0.749024  0.877064

* inplace ana framde de siler.

In [24]:
newDataFrame.drop("D", axis = 1, inplace = True)

In [25]:
newDataFrame

              A         B         C
One    0.396502 -1.042548  0.997983
Two    1.085677 -2.484634 -1.188365
Three  0.309127  1.063626 -2.206446
Four   0.877064  0.089869  0.749024

* 2 türlüde kullanılır.

In [26]:
newDataFrame.loc["Two"]["B"]

-2.484634097398307

In [27]:
newDataFrame.loc["Four","C"]

0.7490244782099157

In [28]:
boolean = newDataFrame < 0

In [29]:
boolean

           A      B      C
One    False   True  False
Two    False   True   True
Three  False  False   True
Four   False  False  False

In [30]:
newDataFrame[boolean]

        A         B         C
One   NaN -1.042548       NaN
Two   NaN -2.484634 -1.188365
Three NaN       NaN -2.206446
Four  NaN       NaN       NaN

In [31]:
newDataFrame[newDataFrame["A"] > 0]

              A         B         C
One    0.396502 -1.042548  0.997983
Two    1.085677 -2.484634 -1.188365
Three  0.309127  1.063626 -2.206446
Four   0.877064  0.089869  0.749024

In [32]:
newDataFrame[newDataFrame["C"] < 0]

              A         B         C
Two    1.085677 -2.484634 -1.188365
Three  0.309127  1.063626 -2.206446

In [33]:
newDataFrame.reset_index()

   index         A         B         C
0    One  0.396502 -1.042548  0.997983
1    Two  1.085677 -2.484634 -1.188365
2  Three  0.309127  1.063626 -2.206446
3   Four  0.877064  0.089869  0.749024

In [34]:
newDataFrame

              A         B         C
One    0.396502 -1.042548  0.997983
Two    1.085677 -2.484634 -1.188365
Three  0.309127  1.063626 -2.206446
Four   0.877064  0.089869  0.749024

In [40]:
newIndexList = ["ABC","DEF","GHI","JKL"]

In [41]:
newDataFrame["New"] = newIndexList

In [42]:
newDataFrame

              A         B         C New Index  New
One    0.396502 -1.042548  0.997983       ABC  ABC
Two    1.085677 -2.484634 -1.188365       DEF  DEF
Three  0.309127  1.063626 -2.206446       GHI  GHI
Four   0.877064  0.089869  0.749024       JKL  JKL

In [44]:
newDataFrame.set_index("New")

            A         B         C New Index
New
ABC  0.396502 -1.042548  0.997983       ABC
DEF  1.085677 -2.484634 -1.188365       DEF
GHI  0.309127  1.063626 -2.206446       GHI
JKL  0.877064  0.089869  0.749024       JKL

In [45]:
newDataFrame.drop("New Index", axis = 1, inplace = True)

In [46]:
newDataFrame

              A         B         C  New
One    0.396502 -1.042548  0.997983  ABC
Two    1.085677 -2.484634 -1.188365  DEF
Three  0.309127  1.063626 -2.206446  GHI
Four   0.877064  0.089869  0.749024  JKL

In [47]:
newDataFrame.set_index("New", inplace = True)

In [48]:
newDataFrame

            A         B         C
New
ABC  0.396502 -1.042548  0.997983
DEF  1.085677 -2.484634 -1.188365
GHI  0.309127  1.063626 -2.206446
JKL  0.877064  0.089869  0.749024

In [50]:
firstIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [52]:
inIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [53]:
joint = list(zip(firstIndex,inIndex))

In [54]:
joint

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [55]:
joint = pd.MultiIndex.from_tuples(joint)

In [57]:
type(joint)

pandas.core.indexes.multi.MultiIndex

In [58]:
myComicsList = [[40,"A"],[30,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [59]:
comicsNumpyArr = np.array(myComicsList)

In [61]:
comicsDataFrame = pd.DataFrame(data = comicsNumpyArr, index = joint, columns = ["Ages","Jobs"])

In [62]:
comicsDataFrame

                   Ages Jobs
Simpson    Homer     40    A
           Bart      30    B
           Marge     30    C
South Park Cartman    9    D
           Kenny     10    E
           Kyle      11    F

In [63]:
comicsDataFrame.loc["Simpson"]

      Ages Jobs
Homer   40    A
Bart    30    B
Marge   30    C

In [64]:
comicsDataFrame.loc["South Park"]

        Ages Jobs
Cartman    9    D
Kenny     10    E
Kyle      11    F

In [65]:
comicsDataFrame.loc["Simpson"].loc["Bart"]

Ages    30
Jobs     B
Name: Bart, dtype: object

In [66]:
comicsDataFrame.index.names = ["Film Name", "Name"]

In [67]:
comicsDataFrame

                   Ages Jobs
Film Name  Name
Simpson    Homer     40    A
           Bart      30    B
           Marge     30    C
South Park Cartman    9    D
           Kenny     10    E
           Kyle      11    F